wangnan31415926/nrf5-sdk-15.3.0/examples/ble_peripheral/ble_app_uart_weilan/main.c
static void application_timers_start(void)
{
    ret_code_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_test_timer_id, APP_TIMER_TICKS(500), NULL);
    APP_ERROR_CHECK(err_code);

}


void Bluetooth_ReciveANDSend(void * p_event_data, uint16_t event_size)
{
	    for (uint32_t i = 0; i < length; i++)
    {
        app_uart_put(uartbuf[i]);
    }
		length=0;
}


void waitlog_timeout_handler(void *p_context)
{
	UNUSED_PARAMETER(p_context);
	printf("waiting\r\n");
}

unsigned int Sum=0;
unsigned short sum_count=0;
void rssi_timeout_handler(void *p_context)
{
		   uint32_t err_code;
       int8_t rssi;
		   uint8_t value[2];
	UNUSED_PARAMETER(p_context);
    sd_ble_gap_rssi_get(m_conn_handle, &rssi,value);
//	printf("CH_id: %d\r\n",value[0]);
	rssi=0-rssi;
//    printf("rssi: %d\r\n",rssi);//
//printf("%d\r\n",rssi);
	 if(AUTO_flag==1)
	 {
		 if(sum_count<200)
     {
			 Sum=Sum+rssi;
       sum_count++;
     }
     else
		 {
			 app_timer_stop(m_wait_timer_id);
       SET_length=(Sum/sum_count)+3;
			 if(SET_length>60){SET_length=SET_length-3;}
			 printf("calibration is ok: %d\r\n",SET_length);
			 Sum=0;
       sum_count=0;
			 AUTO_flag=0;
		 }			 
	 }
	 else
	 {
		 
		Sum=0;
    sum_count=0;		 
	 }
   if(rssi>(SET_length))
	 {
		 if(rssi_fail_num<MAX_num){rssi_fail_num++;}
		 rssi_succe_num=0;
	 }
	 else
	 {
		 if(rssi_succe_num<MAX_num){rssi_succe_num++;}
		 rssi_fail_num=0;
		 
	 }
	 
	 if(rssi_fail_num>MAX_num-1)
	 {
		 flag_led=0;
	 }
	 else
	 {
		 if(rssi_succe_num>MAX_num-1){flag_led=1;}
	 }
    
 }

void test_timeout_handler(void * p_context)
{
	static unsigned char i=0;
	static unsigned short j=1;
	 UNUSED_PARAMETER(p_context);
//	 app_uart_put(i++);
	
//		 ble_nus_data_send(&m_nus, &i, &j, m_conn_handle);
//	i++;

	if(flag_led==0)
	{
		nrf_gpio_pin_toggle(LED);
		nrf_gpio_pin_clear(OUT_PIN);
	}
	else
	{
		nrf_gpio_pin_clear(LED);
		nrf_gpio_pin_set(OUT_PIN);
	}
	 
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
	
	    err_code = app_timer_create(&m_test_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                test_timeout_handler);
    APP_ERROR_CHECK(err_code);
	
		
	    err_code = app_timer_create(&m_rssi_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                rssi_timeout_handler);
    APP_ERROR_CHECK(err_code);
	
	
		    err_code = app_timer_create(&m_wait_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                waitlog_timeout_handler);
    APP_ERROR_CHECK(err_code);

}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
//
			
				memcpy(uartbuf,&p_evt->params.rx_data.p_data[0],p_evt->params.rx_data.length);
	length=p_evt->params.rx_data.length;
	app_sched_event_put(NULL,NULL, Bluetooth_ReciveANDSend); 
//        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
//        {
//            do
//            {
//                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
//                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
//                {
//                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
//                    APP_ERROR_CHECK(err_code);
//                }
//            } while (err_code == NRF_ERROR_BUSY);
//        }
				//
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }
    }

